Тест/Тест/src/Documents/ПоступлениеТМЦ/ПоступлениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТМЦ</name>
  <registerRecords>AccumulationRegister.ДвижениеТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТМЦСкладСнабжение</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.СкладСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/ДвижениеТМЦ/ДвижениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦПоНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТМЦ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ПоступлениеТМЦСкладСнабжение/ПоступлениеТМЦСкладСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТМЦСкладСнабжение</name>
  <registerRecords>AccumulationRegister.ДвижениеТМЦСкладСнабжение</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.СкладСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/ПоступлениеТМЦ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДвижениеТМЦ Приход
	Движения.ДвижениеТМЦ.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение = Движения.ДвижениеТМЦ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
		Движение.МестоХранения = Склад;
		Движение.Код = ТекСтрокаСписокТМЦ.Код;
		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
		Движение.Цена = ТекСтрокаСписокТМЦ.Цена;
		Движение.ТМЦПоНакладной = ТекСтрокаСписокТМЦ.ТМЦ.ТМЦПоНакладной;
		Движение.Доставка		= ТекСтрокаСписокТМЦ.Доставка; 
	КонецЦикла;
	
	//// регистр ДвижениеТМЦСкладСнабжение Приход
	//Движения.ДвижениеТМЦСкладСнабжение.Записывать = Истина;
	//Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//	Движение = Движения.ДвижениеТМЦСкладСнабжение.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//	Движение.МестоХранения = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//	Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//	Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	Движение.Цена = ТекСтрокаСписокТМЦ.Цена;
	//	Движение.ТМЦПоНакладной = ТекСтрокаСписокТМЦ.ТМЦ.ТМЦПоНакладной;
	//КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Склад = Справочники.Стеллаж.НайтиПоКоду("000000530");
	
	///+ГомзМА 10.04.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		
		Ответственный = Ответственный;
		Склад = Справочники.Стеллаж.НайтиПоКоду("000000530");
		Поставщик = ДанныеЗаполнения.Получатель;
		ЗаявкаНаРасход = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = СписокТМЦ.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.ТМЦПоНакладной = ТекСтрокаТовары.Товар;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 10.04.2023
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
	
	Если ЗначениеЗаполнено(ДоставкаСумма) ТОгда 
			
		СуммаКоличество = СписокТМЦ.Итог("Доставка"); 
		ЕдиницаДоставки = ДоставкаСумма /  СуммаКоличество; 
		
		Для Каждого Строка ИЗ СписокТМЦ Цикл 
			Строка.Доставка = ЕдиницаДоставки; 	
		КонецЦикла; 	
					
	КонецЕсли; 
	
	/////+ГомзМА 11.04.2023
	////Проверка на существующую запись ПоступлениеТМЦСкладСнабжение для текущего документа
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПоступлениеТМЦСкладСнабжение.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ПоступлениеТМЦСкладСнабжение КАК ПоступлениеТМЦСкладСнабжение
	//	|ГДЕ
	//	|	ПоступлениеТМЦСкладСнабжение.ПоступлениеТМЦ = &ПоступлениеТМЦ";
	//
	//Запрос.УстановитьПараметр("ПоступлениеТМЦ", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//РезультатЗапроса.Следующий();
	//
	//Если РезультатЗапроса.Количество() = 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
	//	//Создание документа ПоступлениеТМЦСкладСнабжение на основании текущего документа
	//	НовыйДокумент = Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
	//	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	//	НовыйДокумент.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//	НовыйДокумент.Ответственный = Ответственный;
	//	НовыйДокумент.Поставщик = Поставщик;
	//	НовыйДокумент.НомерСчета = НомерСчета;
	//	НовыйДокумент.УПД = УПД;
	//	НовыйДокумент.ДатаСчета = ДатаСчета;
	//	НовыйДокумент.ДатаУПД = ДатаУПД;
	//	НовыйДокумент.Да = Ложь;
	//	
	//	Для каждого СтрокаТЧ Из СписокТМЦ Цикл
	//		НоваяСтрокаТЧ = НовыйДокумент.СписокТМЦ.Добавить();
	//		НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
	//		НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
	//		НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
	//		НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
	//		НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//		НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
	//		НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
	//	КонецЦикла;
	//	
	//	НовыйДокумент.ПоступлениеТМЦ = Ссылка;
	//	
	//	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	//ИначеЕсли РезультатЗапроса.Количество() <> 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
	//	//Если ФормаДокумента.Модифицированность = Истина Тогда
	//		ДокПоступлениеСкладСнабжение = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//		ДокПоступлениеСкладСнабжение.Дата = ТекущаяДатаСеанса();
	//		ДокПоступлениеСкладСнабжение.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//		ДокПоступлениеСкладСнабжение.Ответственный = Ответственный;
	//		ДокПоступлениеСкладСнабжение.Поставщик = Поставщик;
	//		ДокПоступлениеСкладСнабжение.НомерСчета = НомерСчета;
	//		ДокПоступлениеСкладСнабжение.УПД = УПД;
	//		ДокПоступлениеСкладСнабжение.ДатаСчета = ДатаСчета;
	//		ДокПоступлениеСкладСнабжение.ДатаУПД = ДатаУПД;
	//		ДокПоступлениеСкладСнабжение.Да = Ложь;
	//		ДокПоступлениеСкладСнабжение.СписокТМЦ.Очистить();
	//		
	//		Для каждого СтрокаТЧ Из СписокТМЦ Цикл
	//			НоваяСтрокаТЧ = ДокПоступлениеСкладСнабжение.СписокТМЦ.Добавить();
	//			НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
	//			НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
	//			НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
	//			НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
	//			НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//			НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
	//			НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
	//		КонецЦикла;
	//		
	//		ДокПоступлениеСкладСнабжение.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	/////-ГомзМА 11.04.2023
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
		///+ГомзМА 11.04.2023
	//Проверка на существующую запись ПоступлениеТМЦСкладСнабжение для текущего документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТМЦСкладСнабжение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТМЦСкладСнабжение КАК ПоступлениеТМЦСкладСнабжение
		|ГДЕ
		|	ПоступлениеТМЦСкладСнабжение.ПоступлениеТМЦ = &ПоступлениеТМЦ";
	
	Запрос.УстановитьПараметр("ПоступлениеТМЦ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество() = 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
		//Создание документа ПоступлениеТМЦСкладСнабжение на основании текущего документа
		НовыйДокумент = Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
		НовыйДокумент.Ответственный = Ответственный;
		НовыйДокумент.Поставщик = Поставщик;
		НовыйДокумент.НомерСчета = НомерСчета;
		НовыйДокумент.УПД = УПД;
		НовыйДокумент.ДатаСчета = ДатаСчета;
		НовыйДокумент.ДатаУПД = ДатаУПД;
		//НовыйДокумент.Да = Ложь;
		НовыйДокумент.Организация = Организация;
		
		Для каждого СтрокаТЧ Из СписокТМЦ Цикл
			НоваяСтрокаТЧ = НовыйДокумент.СписокТМЦ.Добавить();
			НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
			НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
			НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
			НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
			НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
			НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
			НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
		КонецЦикла;
		
		НовыйДокумент.ПоступлениеТМЦ = Ссылка;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли РезультатЗапроса.Количество() <> 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
		//Если ФормаДокумента.Модифицированность = Истина Тогда
			ДокПоступлениеСкладСнабжение = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ДокПоступлениеСкладСнабжение.Дата = ТекущаяДатаСеанса();
			ДокПоступлениеСкладСнабжение.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
			ДокПоступлениеСкладСнабжение.Ответственный = Ответственный;
			ДокПоступлениеСкладСнабжение.Поставщик = Поставщик;
			ДокПоступлениеСкладСнабжение.НомерСчета = НомерСчета;
			ДокПоступлениеСкладСнабжение.УПД = УПД;
			ДокПоступлениеСкладСнабжение.ДатаСчета = ДатаСчета;
			ДокПоступлениеСкладСнабжение.ДатаУПД = ДатаУПД;
			//ДокПоступлениеСкладСнабжение.Да = Ложь;
			ДокПоступлениеСкладСнабжение.Организация = Организация;
			ДокПоступлениеСкладСнабжение.СписокТМЦ.Очистить();
			
			Для каждого СтрокаТЧ Из СписокТМЦ Цикл
				НоваяСтрокаТЧ = ДокПоступлениеСкладСнабжение.СписокТМЦ.Добавить();
				НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
				НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
				НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
				НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
				НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
				НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
				НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
			КонецЦикла;
			
			ДокПоступлениеСкладСнабжение.Записать(РежимЗаписиДокумента.Проведение);
			
			
			
		//КонецЕсли;
		
	КонецЕсли;
	///-ГомзМА 11.04.2023
	
КонецПроцедуры
